Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། བྲམ་ཟེ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་སེམས་ཅན་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་རྣམས་ལ་ཕན་པ་བྱེད་པ་དང་།
en: Noble son, the tathāgata arhat samyaksam­buddha Ratnagarbha said to the brahmin Samudrareṇu, ‘Excellent, excellent, great brahmin of great compassion! You are a compassionate benefactor for countless beings!

source: འཇིག་རྟེན་ལ་སྣང་བ་བྱེད་པར་གྱུར་པ་ནི་སྙིང་རྗེ་དང་ལྡན་པ་ཡིན་ཏེ་ལེགས་སོ་ལེགས་སོ།
en: You appear in the world like the sun! “ ‘

source: །བྲམ་ཟེ་འདི་ལྟ་སྟེ་དཔེར་ན་མེ་ཏོག་གི་ཞིང་ཕུན་སུམ་ཚོགས་པ་ཞིག་ལ་ཁ་དོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་དང་། རེག་པ་སྣ་ཚོགས་དང་། འདབ་མ་སྣ་ཚོགས་དང་། སྡོང་བུ་སྣ་ཚོགས་དང་། རྩ་བ་སྣ་ཚོགས་དང་།
en: It is like this, brahmin—suppose there were a field of flowers, complete with a variety of colors, a variety of fragrances, a variety of textures, a variety of petals, a variety of stalks, a variety of roots, and a variety of medicinal ingredients.

source: སྨན་གྱི་ཡོ་བྱད་ཀྱི་གནས་སྣ་ཚོགས་ཡོད་དོ། །དེ་ལ་མེ་ཏོག་ཁ་ཅིག་གི་ཁ་དོག་དང་དྲིས་ནི་དཔག་ཚད་བརྒྱར། ཁ་ཅིག་གིས་ནི་དཔག་ཚད་ཉིས་བརྒྱར། ཁ་ཅིག་གིས་ནི་དཔག་ཚད་སུམ་བརྒྱར་ལྷང་ངེ་ལྷན་ནེར་བྱེད་ཅིང་དེ་བཞིན་དུ་སྦྱར་ཏེ། དེ་ན་མེ་ཏོག་ཁ་ཅིག་གི་ཁ་དོག་དང་དྲིས་ནི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ལྷང་ངེ་ལྷན་ནེར་བྱེད་ལ།
en: Some flowers shine and illuminate a hundred yojanas with their color and scent, some two hundred yojanas, and some three hundred yojanas, and similarly some flowers shine and illuminate with their color and scent the entire world realm of four continents. “ ‘

source: དེ་ན་སེམས་ཅན་གང་དག་མིག་མེད་པ་དེ་དག་གིས་མེ་ཏོག་དེའི་དྲི་བསྣམས་ན་ནི་མིག་དག་ཐོབ་པར་འགྱུར། འོན་པ་རྣམས་ཀྱིས་ནི་རྣ་བ་དག་ཐོབ་པར་འགྱུར། ཡན་ལག་ཐམས་ཅད་ཀྱི་བར་དག་ཉམས་པ་རྣམས་ཀྱིས་ནི་ཡན་ལག་ཐམས་ཅད་འཐོབ་པར་འགྱུར་བ་དང་།
en: And when beings who are blind smell that scent of flowers there, they become able to see, the deaf are able to hear, and so on, up to and including those deficient in limbs regain all their limbs.

source: དེ་ན་སེམས་ཅན་གང་དག་ནད་བཞི་བརྒྱ་རྩ་བཞི་པོ་དག་གིས་གཙེས་པར་གྱུར་པ་དེ་དག་གིས་དྲི་བསྣམས་ན་ནི་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་བ་དང་དེ་ན་སེམས་ཅན་གང་དག་མྱོས་པ་དང་། བརྒྱལ་བ་དང་། སྨྱོས་པ་དང་།
en: The beings who are afflicted by the 404 kinds of illness become cured of them all when they smell that scent.

source: རེངས་པ་དང་། སེམས་རྨུགས་པ་དང་། སེམས་རྣམ་པར་གཡེངས་པ་དང་། དྲན་པ་རབ་ཏུ་ཉམས་པ་རྣམས་ཀྱིས་མེ་ཏོག་དེ་དག་གི་དྲི་བསྣམས་ན་ནི་དྲན་པ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་བ་ཞིག་ཡོད་ལ།
en: Those beings who are intoxicated, unconscious, insane, paralyzed, drowsy, distracted, or who have lost their memory regain all their memory when they smell the scent of those flowers. “ ‘

source: མེ་ཏོག་གི་ཤིང་དེའི་ནང་ནས་པད་མ་དཀར་པོ་མཁྲང་བ་སྲ་བ་རྡོ་རྗེ་ལས་གྲུབ་པ་འཇམ་པ་སྡོང་བུ་ནི་བཻ་དཱུརྱ། འདབ་མ་ནི་གསེར། ཟེ་འབྲུ་ནི་རྡོའི་སྙིང་པོ། ཟེ་བ་ནི་མུ་ཏིག་དམར་པོ། འཕང་དུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་།
en: And in the middle of that field of flowers there has appeared a white lotus, firm and solid, made of diamond, with a beryl stalk, gold leaves, an emerald pericarp, and red pearl filaments, that is 84,000 yojanas tall and 100,000 yojanas wide.

source: རྒྱར་ནི་དཔག་ཚད་འབུམ་ཡོད་པ་གཅིག་ཅིག་སྐྱེས་པར་གྱུར་ལ། པད་མ་དཀར་པོ་དེའི་ཁ་དོག་དང་དྲིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཏུ་ཁྱབ་ཅིང་ལྷང་ངེ་ལྷན་ནེར་འགྱུར་ལ།
en: And the white lotus’s color shines and its scent spreads throughout world realms in the ten directions as numerous as the number of particles in a buddha realm. “ ‘

source: བྲམ་ཟེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་པོ་དེ་དག་ན་སེམས་ཅན་གྱི་ཁམས་གང་དག་ལུས་མི་འཐུན་པ་དང་། ནད་ཀྱིས་ཉེན་པ་དང་། ཡན་ལག་ཉམས་པ་དང་། མྱོས་པ་དང་། བརྒྱལ་བ་དང་།
en: Brahmin, in world realms in the ten directions as numerous as the number of particles in a buddha realm, there are beings who have physical difficulties, who are afflicted by illness, who are deficient in limbs, who are intoxicated, unconscious, insane, or sleepy, who have lost their memory, and who have distracted minds.

source: སྨྱོས་པ་དང་། གཉིད་ལོག་པ་དང་། དྲན་པ་རབ་ཏུ་ཉམས་པ་དང་། སེམས་རྣམ་པར་གཡེངས་པའི་སེམས་ཅན་དེ་དག་གིས་པད་མ་དཀར་པོ་དེའི་འོད་མཐོང་ཞིང་དྲི་བསྣམས་ན་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་ཞིང་དྲན་པ་ཡང་ཐོབ་པར་འགྱུར་བ་དང་།
en: When those beings see the light of that white lotus and smell its scent, all their illnesses cease, and they regain their memory. “ ‘

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སེམས་ཅན་གང་དག་ཤི་ནས་ཡུན་རིང་པོ་མ་ལོན་ཞིང་ལུས་མ་ཞིག་པ་དེ་དག་གི་རོ་ལ་པད་མ་དཀར་པོ་དེའི་འོད་ཟེར་དག་གིས་ཕོག་གམ།
en: And when the white lotus’s light illuminates or its scent reaches the undestroyed corpses of beings who have recently died in the buddha realms, their corpses come back to life and get up again.

source: དྲིས་རེག་ན་རོ་དེ་དག་ཀྱང་སྲོག་གི་དབང་པོ་འཐོབ་པར་འགྱུར་ཞིང་ཡང་ཕྱིས་ལངས་ཏེ་མཛའ་བཤེས་དང་། སྣག་གི་གཉེན་མཚམས་དག་མཐོང་ནས་དེ་དག་ཐམས་ཅད་སྐྱེད་མོས་ཚལ་དུ་ཞུགས་ཏེ། འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་དག་འབྱོར་ཅིང་ལྡན་པར་འགྱུར་ལ་གནས་པར་འགྱུར་བ་དང་།
en: And when they see their friends and relatives, they all enter a park and there enjoy the five sensory pleasures.

source: གང་དག་ཡང་དེ་ནས་ཤི་འཕོས་པར་འགྱུར་བ་དེ་དག་ཀྱང་ཚངས་པའི་གནས་དག་པར་སྐྱེ་བར་འགྱུར་ལ།
en: Those who then pass away are reborn in the pure abode of Brahmā.

source: དེ་དག་དེར་ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་ཞིང་ཡུན་རིང་པོར་གནས་པར་འགྱུར་བ་དང་། དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་གཞན་དུ་སྐྱེ་བར་མི་འགྱུར་བ་ཞིག་ཡོད་ན།
en: They then live there for a long time—with an immeasurable lifespan— [F.251.b] and do not pass away from there to be reborn anywhere else. “ ‘

source: བྲམ་ཟེ་མེ་ཏོག་གི་ཤིང་དེ་ཇི་ལྟ་བར་ཐེག་པ་ཆེན་པོའི་འདུས་པ་འདི་ཡང་དེ་བཞིན་དུ་བལྟ་བར་བྱའོ།
en: Brahmin, this Mahāyāna assembly is like that field of flowers.

source: །ཇི་ལྟར་ཉི་མ་འཆར་བ་ཉེ་བར་གནས་པའི་དུས་ན་མེ་ཏོག་དེ་དག་ཁ་ཕྱེ་ཞིང་རབ་ཏུ་རྒྱས་པར་གྱུར་ནས་ལྷང་ངེ་ལྷན་ནེ། ཤིང་ཁ་ཅིག་གི་འཕང་དུ་ནི་དཔག་ཚད་བརྒྱ། ཁ་ཅིག་གི་འཕང་དུ་ནི་དཔག་ཚད་སྟོང་གི་བར་དུ་གྱུར་ནས་སེམས་ཅན་མང་པོ་དེ་དག་གི་ནད་སྣ་ཚོགས་རབ་ཏུ་ཞི་བར་བྱེད་པ་དེ་ལྟར་ནི་འཇིག་རྟེན་དུ་སངས་རྒྱས་ཉི་མ་དེ་བཞིན་གཤེགས་པ་སྐྱེས་བུ་དམ་པ་བྱུང་བ་ཡིན་ནོ།
en: Just as, at the time of sunrise, the flowers open up, blossom, radiate, and illuminate—some a hundred yojanas high, some a thousand yojanas high—and they cure many beings of various illnesses, in the same way, the worthy being, the Tathāgata, the sun-like Buddha has appeared in the world. “ ‘

source: །ཇི་ལྟར་ཉི་མ་ཤར་བའི་འོད་ཟེར་དག་གིས་མེ་ཏོག་དེ་དག་ཁ་ཕྱེ་ཞིང་ལམ་མེ་ལྷང་ངེ་ལྷན་ནེར་གྱུར་ནས། ནད་སྣ་ཚོགས་ཀྱིས་ཉེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་ནད་ཉེ་བར་ཞི་བར་འགྱུར་བ་དེ་ལྟར་ནི་སྐྱེས་བུ་དམ་པ་ང་འཇིག་རྟེན་དུ་བྱུང་སྟེ། ཐུགས་རྗེའི་འོད་ཟེར་དག་གིས། སེམས་ཅན་རྣམས་ལ་ཁྱབ་པར་མཛད་ཅིང་ཁ་ཕྱེ་ནས་ཡང་དང་ཡང་དུ་སེམས་ཅན་རྣམས་ཀྱིས་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་དག་ལ་མངོན་པར་སྦྱོར་བར་མཛད་པ་དང་།
en: Just as those flowers are opened by the light rays of the sunrise, and they shine, radiate, and illuminate, and beings who are afflicted by various illnesses are cured, in the same way, worthy being, I have appeared in the world, bathed beings in the light rays of compassion, opening them, bringing beings again and again to the practice of the three activities that generate merit. “ ‘

source: ཁྱོད་ཀྱིས་ཀྱང་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་ནས་ང་ལ་ཕུལ་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་ངའི་དྲུང་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཡོངས་སུ་བཟུང་སྟེ།
en: You have encouraged countless, innumerable beings to aspire to the highest, most complete enlightenment, and you have made them practice it and remain in it. You have brought them to me, and in my presence they have all chosen buddha realms.

source: ཁ་ཅིག་གིས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དག་ཡོངས་སུ་བཟུང་།
en: Some have chosen pure buddha realms.

source: ཁ་ཅིག་གིས་ནི་ཡོངས་སུ་མ་དག་པ་དག་ཡོངས་སུ་བཟུང་ཞིང་རང་རང་གི་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་དེ་ལྟར་ངས་ཀྱང་ལུང་བསྟན་པ་ཡིན་ནོ།
en: Some have chosen impure buddha realms, and I have prophesied that it will be as they have prayed for. “ ‘

source: །སྐྱེས་བུ་དམ་པ་གང་དག་གིས་ངའི་ཐད་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དག་ཡོངས་སུ་བཟུང་བ་དེ་དག་གིས་ནི་འདུལ་བའི་སེམས་ཅན་བསམ་པ་དག་པ། གདུལ་སླ་བ།
en: Some worthy beings have in my presence chosen pure realms and chosen beings who have pure motivation, have planted good roots, and are easy to train to be their disciples.

source: དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དག་ཡོངས་སུ་བཟུང་བས་ན་དེའི་ཕྱིར་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་མི་བྱ་སྟེ།
en: Therefore, those bodhisattvas are not called mahāsattvas.

source: དེ་དག་ནི་སྐྱེས་བུ་དམ་པ་ཆེན་པོའི་བྱ་བ་བྱེད་པ་མ་ཡིན་ནོ།
en: They do not have the activity of a great, excellent person.

source: །དེ་དག་ནི་སྙིང་རྗེ་ཆེན་པོས་སེམས་དང་སེམས་ལས་བྱུང་བ་དག་ལ་འཇུག་པ་མ་ཡིན་ནོ།
en: Great compassion does not enter their minds and mental activities. [

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་བ་མ་ཡིན་ཏེ།
en: F.252.b] Those bodhisattvas do not seek enlightenment out of compassion for all beings.

source: གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དེ་དག་ཡོངས་སུ་འཛིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ནི་སྙིང་བརྩེ་བ་སྤངས་པ་ཡིན་ནོ།
en: The bodhisattvas who have chosen pure realms have cast aside compassion.

source: །གང་དག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དག་ཡོངས་སུ་སྤངས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་ནི་ཡེ་ཤེས་དང་། བསམ་པ་ལ་མཁས་པར་གྱུར་པ་མ་ཡིན་ནོ། །གང་དག་ཇི་ལྟར་བདག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་སྤངས་པ།
en: The bodhisattvas who wish for buddha realms that are bereft of followers of the Śrāvakayāna and of the Pratyekabuddhayāna are not excellent in wisdom and motivation.

source: དགེ་བའི་རྩ་བ་དང་འགྲོགས་པར་གྱུར་པ། བུད་མེད་རྣམ་པར་སྤངས་པ། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་རྣམ་པར་སྤངས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: They pray to attain the complete enlightenment of perfect buddhahood in a buddha realm without śrāvakas, without pratyekabuddhas, where beings have planted good roots, where there are no women, where there are no hells, where there are no animals, and where there is no world of Yama.

source: ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་སྤངས་པ་ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་གིས་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: They pray to teach only the Mahāyāna to bodhisattvas who have entered the Mahāyāna, and for there to be no śrāvakas or pratyekabuddhas.

source: བདག་གིས་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་ཚེ་རིང་པོར་གྱུར་ཏེ།
en: They pray to live for a long time after enlightenment.

source: ཡུན་རིང་དུ་གནས་ཤིང་བསྐལ་པ་མང་པོར་བསམ་པ་དག་པ་དང་། གདུལ་སླ་བ་དང་། དགེ་བའི་རྩ་བ་དང་འགྲོགས་པར་གྱུར་པ་རྣམས་ལ་ཆོས་སྟོན་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་དེ་ལྟ་བུ་འདེབས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་དེས་ན་ཡེ་ཤེས་དང་།
en: They pray that they will teach the Dharma for a long time, for many eons, to those who have pure motivation, who have planted good roots, and who are easy to train.

source: བསམ་པ་ལ་མཁས་པར་གྱུར་པ་ཡང་མ་ཡིན་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་ཀྱང་མི་བྱའོ།
en: The bodhisattvas who pray in that way are not excellent in wisdom and motivation. Those bodhisattvas are not said to be mahāsattvas.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་དེས་ཕྱག་བརྐྱང་སྟེ། སོར་མོ་ལྔ་ལས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས། ཁ་དོག་དུ་མ། ཁ་དོག་འབུམ་ཕྲག་དུ་མ་དང་ལྡན་པ་དག་རབ་ཏུ་བཀྱེའོ།
en: Then, noble son, the Tathāgata Ratnagarbha extended his hand, and his five fingers emitted light rays of various colors, of many colors—of many hundreds of thousands of colors.

source: །འོད་ཟེར་དེ་དག་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་ཕྱོགས་སུ་དོང་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སྣང་བར་བྱས་ནས།
en: Those countless, innumerable light rays went into the ten directions and illuminated the buddha realms.

source: དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་མཐེ་བོ་ཅན་ཞེས་བྱ་བ་ཡོད་དེ།
en: There was a world realm called Aṅguṣṭhā.

source: འཇིག་རྟེན་གྱི་ཁམས་མཐེ་བོ་ཅན་དེ་ན་མི་རྣམས་ནི་ཚེ་ལོ་བཅུ་པ་མདོག་ངན་པ། མི་སྡུག་པ། མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་སྟེ། ཁྲུན་ནི་མཐེ་བོའི་ཚད་ཙམ་མོ། །དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: There, in the Aṅguṣṭhā world realm, the lifespan of the people was ten years, they had bad complexion, they were ugly, they had bad roots, and their height was that of a thumb.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སྐུའི་ཁྲུན་ཡང་རྩོད་པའི་དུས་ཀྱི་ཚད་ཀྱི་མི་རྣམས་ཀྱི་ཁྲུ་གང་དང་།
en: There was a tathāgata arhat samyaksam­buddha named Jyotīrasa.

source: མཐེ་བོ་ཙམ་གྱི་མི་རྣམས་ཀྱི་ཁྲུ་གང་དང་། སོར་བདུན་གྱི་ཚད་ཙམ་སྟེ།
en: He was one cubit in height; among the people who were one thumb in size, he was seven thumbs in size.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཡང་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་འཁོར་བཞི་པོ་རྣམས་ལ་ཐེག་པ་གསུམ་པོ་དག་གིས་ཆོས་སྟོན་ཏོ།
en: That tathāgata resided, lived, and remained there, teaching the Dharma of the three yānas to the fourfold assembly. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དང་། མི་དེ་དག་དང་། དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། དེ་བཞིན་གཤེགས་པ་སྐར་མ་ལ་དགའ་བ་དེས་ནི་བསྐལ་པ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་འདས་པ་ན་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་གདུགས་མངོན་པར་འཕགས་པར་སྣང་བའི་སྤྱན་སྔར་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Noble son, the entire assembly saw that buddha realm, those people, and that tathāgata, and the tathāgata arhat samyaksam­buddha Ratnagarbha said, ‘The Tathāgata Jyotīrasa first developed the aspiration for the highest, most complete enlightenment countless, innumerable eons ago in front of the Tathāgata Ratna­cchatrābhyudgatāva­bhāsa.

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་མང་པོ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: He guided many millions of trillions of beings to aspire to the highest, most complete enlightenment and made them enter and remain in it.

source: །སེམས་ཅན་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་གདུགས་མངོན་པར་འཕགས་པར་སྣང་བའི་སྤྱན་སྔར་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྨོན་ལམ་བཏབ་སྟེ།
en: Those beings also made prayers in front of the Tathāgata Ratna­cchatrābhyudgatāva­bhāsa, in accordance with their own wishes.

source: ཁ་ཅིག་གིས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་དག་པ་དག་ཡོངས་སུ་བཟུང་ངོ་།
en: Some chose the array of qualities of a pure buddha realm.

source: །ཁ་ཅིག་གིས་ནི་ཡོངས་སུ་མ་དག་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པ་དག་པ་ཡོངས་སུ་བཟུང་ངོ་།
en: Some chose an impure buddha realm that has the five degeneracies. “ ‘

source: །དེ་ན་སེམས་ཅན་ཆེན་པོ་དེས་ང་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཞག་སྟེ་རབ་ཏུ་གནས་པར་བྱས་ནས།
en: There, that mahāsattva encouraged me to aspire to the highest, most complete enlightenment and made me enter and remain in it.

source: དེར་ངས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་གདུགས་མངོན་པར་འཕགས་པར་སྣང་བའི་སྤྱན་སྔར་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་སྨོན་ལམ་བཏབ་བོ།
en: There, in front of the Tathāgata Ratna­cchatrābhyudgatāva­bhāsa, I made the prayer to attain the complete enlightenment of perfect buddhahood in a buddha realm that has the array of qualities of the five degeneracies.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་ང་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས་ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: That tathāgata congratulated me and gave me the prophecy of the highest, most complete enlightenment. “ ‘

source: །དེ་ན་གང་གིས་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པའི་དགེ་བའི་བཤེས་གཉེན་སྐྱེས་བུ་དམ་པ་དེས་སྙིགས་མ་ལྔ་ཤིན་ཏུ་བདོ་ཞིང་ཉོན་མོངས་པ་དང་རྩོད་པའི་དུས་ལ་བབ་པའི་ཚེ་ཤིན་ཏུ་ཉོན་མོངས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་བཟུང་ཞིང་འདུལ་བའི་སེམས་ཅན་མཚམས་མེད་པ་བྱེད་པ་དང་། མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་དང་། སེམས་ཀྱི་རྒྱུད་ཚིག་པ་དང་། འཁོར་བའི་འབྲོག་དགོན་པ་ཉམ་ང་བར་ཞུགས་པ་དག་སྨོན་ལམ་གྱིས་ཡོངས་སུ་བཟུང་ནས་སྐྱེས་བུ་དམ་པ་དེ་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་གཞན་དང་གཞན་དག་ན་བཞུགས་ཏེ།
en: The worthy being who was the kalyāṇamitra who made me aspire to enlightenment made a prayer in which he chose a world where the five degeneracies are powerful, in an afflicted buddha realm during a kaliyuga, and he chose as his disciples those whose minds are burning, who have committed the bad actions with immediate results at death, who are engaged in bad roots, and who are in despair within the wilderness of saṃsāra.

source: འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་ལེགས་སོ་ཞེས་ཕོ་ཉ་བཏང་སྟེ།
en: The bhagavat buddhas who reside, live, and remain in the various, countless, innumerable worlds in the ten directions sent their emissaries to convey their congratulations and gave him the name Mahā­karuṇā­vairocana­saumya.

source: སྙིང་རྗེ་ཆེན་པོ་རྣམ་པར་སྣང་བྱེད་ཞི་བ་ཞེས་བྱ་བར་མིང་བཏགས་སོ། །ངའི་དགེ་བའི་བཤེས་གཉེན་ཕན་པར་མཛད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་རྣམ་པར་སྣང་བྱེད་ཞི་བ་དེ་ད་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་མཐེ་བོ་ཅན་དུ་མཐེ་བོའི་ཚད་ཙམ་གྱི་མི་རྣམས་ཀྱི་ནང་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལོན་ཏེ།
en: My kalyāṇamitra and benefactor, the bodhisattva mahāsattva Mahā­karuṇā­vairocana­saumya, is now in the world realm Aṅguṣṭhā, where not long ago he attained complete enlightenment among the thumb-sized people.

source: དེ་བཞིན་གཤེགས་པ་ཁྲུ་གང་ཙམ་པོ་དེས་མཐེ་བོའི་ཚད་ཙམ་གྱི་མི་དེ་དག་ཉིད་ཀྱི་ཁྲུ་གསུམ་གྱི་ཚད་ཙམ་གྱིས་སྐྱེ་དགུ་ཚེ་ལོ་བཅུ་པ་རྣམས་ལ་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏོ།
en: Being a cubit in height among those thumb-sized people, that tathāgata has turned the Dharma wheel that possesses the Dharma for those people who have a lifespan of ten years. “ ‘

source: །དེས་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་ཐོབ་པ་དེ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ཕོ་ཉ་དག་བཏང་ངོ་།
en: When he attained enlightenment, the buddha bhagavats whom he first encouraged to aspire to the highest, most complete enlightenment and made enter and remain in that aspiration, who then dwelled, lived, and remained in countless, innumerable buddha realms in the ten directions, sent him emissaries to make offerings to him.

source: །དེས་དང་པོ་གང་དག་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དག་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྔོན་གྱི་བྱས་པ་གཟོ་ཞིང་རྗེས་སུ་དགོངས་པ་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མེ་ཏོག་དག་བསྐུར་རོ།
en: The buddha bhagavats whom he first introduced to the perfection of generosity, and so on, up to and including the perfection of wisdom, and whom he caused to enter and remain in the perfection of wisdom, remembering what he had done, sent flowers to that tathāgata. “ ‘

source: །བྲམ་ཟེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་དང་བདག་ན་སེམས་ཅན་ཚེ་རིང་བ། བསམ་པ་ཡོངས་སུ་དག་པ། བདེ་བར་གནས་པ་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་པ་རྣམས་དང་།
en: Brahmin, see how those bhagavat buddhas carry out the deeds of a buddha in pure buddha realms where beings have long lives and pure motivation and live happily.

source: དེ་བཞིན་གཤེགས་པ་སྐར་མ་ལ་དགའ་བ་དེ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་ངན་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པ་དེ་ལྟ་བུར་སངས་རྒྱས་ཉིད་ཐོབ་ནས་སེམས་ཅན་མཚམས་མེད་པ་བྱེད་པ་དང་། མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་གྱུར་པའི་བར་དག་ལ་ཚེ་ཐུང་ངུས་སངས་རྒྱས་ཀྱི་མཛད་པ་མང་པོ་ལྷག་པར་མཛད་ཅིང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱང་མ་སྤངས་པར་ཆོས་སྟོན་པ་ལ་ལྟོས།
en: See how the Tathāgata Jyotīrasa made a special prayer and chose to attain buddhahood in a very bad buddha realm with the five degeneracies, in which he would perfectly accomplish the activity of a buddha, teach the Dharma without leaving aside śrāvakas and pratyekabuddhas, have a short life, and be among beings who have planted bad roots and committed the bad actions with immediate results at death. “ ‘

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཀྱང་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་ཤིན་ཏུ་ངན་ཅིང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་མཚམས་མེད་པ་བྱེད་པ་དང་།
en: Likewise, worthy being, you have outshone this entire assembly of bodhisattvas and you have made the most outstanding prayer in which you chose a very bad buddha realm with the five degeneracies.

source: མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པའི་བར་གྱི་འདུལ་བའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་བཟུང་ཞིང་སྨོན་ལམ་ཁྱད་པར་ཅན་བཏབ་པས་ན།
en: You have done so for your disciples, beings who have committed the bad actions with immediate results at death, and so on, up to and including those who have created bad roots. “ ‘

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་འདི་དག་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གིས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་ཡོངས་སུ་སྤངས་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཡོངས་སུ་སྤངས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་རྣམས་ཡོངས་སུ་བཟུང་ཞིང་འདུལ་བའི་སེམས་ཅན་བསམ་པ་དག་པ་ཤིན་ཏུ་དུལ་བ།
en: The bodhisattvas chose pure buddha realms that have no hells, no animals, no śrāvakas, and no pratyekabuddhas, and they chose disciples who have planted good roots, have pure motivation, and are well disciplined.

source: དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དག་ཡོངས་སུ་བཟུང་བའི་སེམས་ཅན་དེ་དག་ནི་མེ་ཏོག་ལྟ་བུ་ཞེས་བྱ་སྟེ།
en: Those beings are said to be like the flowers.

source: གང་དག་ཤིན་ཏུ་དུལ་བ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་རྣམས་ཀྱི་ནང་དུ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་འགྱུར་བ་དེ་དག་ནི་པད་མ་དཀར་པོ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་མ་ཡིན་ནོ།
en: Those who accomplish the activity of a buddha among beings who have planted good roots and are well disciplined are not bodhisattva mahāsattvas like the white lotus. “ ‘

source: །བྲམ་ཟེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལེ་ལོའི་དངོས་པོ་ནི་བཞི་སྟེ།
en: Brahmin, there are four cases of laziness of bodhisattvas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྨོན་པ་དང་། སེམས་ཅན་བསམ་པ་ཡོངས་སུ་དག་པ་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་སྨོན་པ་དང་། བྱང་ཆུབ་ཐོབ་ནས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་གཏམ་མི་སྟོན་པར་སྨོན་པ་དང་། བྱང་ཆུབ་ཐོབ་ནས་ཚེ་རིང་བར་སྨོན་པ་སྟེ།
en: Praying for a pure buddha realm; praying to accomplish the activity of a buddha among beings with pure thoughts; praying that after enlightenment they will not teach the Śrāvakayāna or the Pratyekabuddhayāna; and praying that after enlightenment they will have a long life.

source: བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལེ་ལོའི་དངོས་པོ་ཡིན་ཏེ།
en: These are the four cases of laziness of bodhisattvas.

source: དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་མེ་ཏོག་ལྟ་བུ་རྣམས་ཞེས་བྱའི། པད་མ་དཀར་པོ་ལྟ་བུ་ཡང་མ་ཡིན་ལ་སེམས་དཔའ་ཆེན་པོ་ཞེས་ཀྱང་མི་བྱ་སྟེ།
en: Thereby they are said to be bodhisattvas who are like flowers, not like the white lotus; they are not said to be mahāsattvas.

source: བྲམ་ཟེ་འདི་ལྟ་སྟེ་དཔེར་ན་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་འདི་མ་གཏོགས་པར་ཁྱབ་འཇུག་རླུང་གིས་གང་གི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མ་དག་པ་ཡོངས་སུ་བཟུང་ཞིང་འདུལ་བའི་སེམས་ཅན་ཉོན་མོངས་པས་དཀྲུགས་པ་རྣམས་དང་། བསྐལ་པ་བཟང་པོའི་རིགས་ཀྱི་བུ་ཁ་ཅིག་ཀྱང་ཡོངས་སུ་བཟུང་བ་ལྟ་བུའོ།
en: An example of this, brahmin, is this assembly of bodhisattvas—except for Vāyuviṣṇu, because he chose an impure buddha realm and chose beings disturbed by the kleśas who are guidable—as well as some noble sons of the Bhadraka eon. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་བརྩམས་པའི་དངོས་པོ་ནི་བཞི་པོ་འདི་དག་ཡིན་ཏེ།
en: There are four cases of applied diligence of bodhisattva mahāsattvas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མ་དག་པར་སྨོན་པ་དང་། སེམས་ཅན་བསམ་པ་ཡོངས་སུ་མ་དག་པ་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་སྨོན་པ་དང་། བྱང་ཆུབ་ཐོབ་ནས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་གཏམ་སྟོན་པར་སྨོན་པ་དང་། བྱང་ཆུབ་ཐོབ་ནས་ཚེ་ཧ་ཅང་ཡང་མི་རིང་ཧ་ཅང་ཡང་མི་ཐུང་བ་ཞིག་བར་མར་སྒྲུབ་པར་སྨོན་པ་སྟེ།
en: Praying for an impure buddha realm; praying to accomplish the activity of a buddha among beings with impure thoughts; praying that after enlightenment they will teach the Śrāvakayāna and Pratyekabuddhayāna; and praying that after enlightenment they will not have a very long or a very short but a medium-length life.

source: བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་བརྩོན་འགྲུས་བརྩམས་པའི་དངོས་པོ་ཡིན་ཏེ།
en: These are the four cases of applied diligence of bodhisattva mahāsattvas.
